app/serializers/event_serializer.rb

  def members_data
    @event.event_members.includes(:user).map do |m|
---
SELECT "event_members".* FROM "event_members" WHERE "event_members"."event_id" = $1  [["event_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2, $3)  [["id", 1], ["id", 2], ["id", 3]]