app/controllers/api/v1/auth_controller.rb

INSERT INTO "users" ("email", "password_digest", "nickname", "created_at", "updated_at", "is_admin") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["email", "[FILTERED]"], ["password_digest", "[FILTERED]"], ["nickname", "七七"], ["created_at", "2026-05-06 03:32:03.704510"], ["updated_at", "2026-05-06 03:32:03.704510"], ["is_admin", false]]
---
      def register
        user = User.new(register_params)
        if user.save

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "[FILTERED]"], ["LIMIT", 1]]
---
      def login
        user = User.find_by(email: params[:email]&.downcase)