app/controllers/api/v1/events_controller.rb

      def join
        if @event.host_id == current_user.id
          return render json: { error: "You are the host" }, status: :unprocessable_entity
        end

        if @event.cancelled?
          return render json: { error: "Event is cancelled" }, status: :unprocessable_entity
        end

        member = @event.event_members.find_by(user_id: current_user.id)

        if member&.active_member?
          return render json: { error: "Already joined" }, status: :unprocessable_entity
        end

        if member&.rejected?
          return render json: { error: "已被拒絕，無法重新申請" }, status: :unprocessable_entity
        end

        cross_gender = params[:cross_gender].present? && @event.allow_cross_gender
        effective_gender = cross_gender ? (current_user.gender == "male" ? "female" : "male") : current_user.gender

        unless slot_available_for?(effective_gender)
          return render json: { error: "沒有符合性別的空位" }, status: :unprocessable_entity
        end

        if member&.cancelled?
          member.update!(cross_gender: cross_gender)
---
UPDATE "event_members" SET "status" = $1, "updated_at" = $2 WHERE "event_members"."id" = $3  [["status", 3], ["updated_at", "2026-05-06 06:00:10.392411"], ["id", 7]]

          render json: { message: "Join request sent" }, status: :created
        else
          member = @event.event_members.build(user: current_user, status: :pending, cross_gender: cross_gender)
          if member.save
---
INSERT INTO "event_members" ("event_id", "user_id", "status", "created_at", "updated_at", "cross_gender", "confirmed_at", "rejected_at", "leave_requested_at", "cancelled_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

      def set_event
        @event = Event.unscoped.includes(script_version: :script).merge(Event.unscoped.includes(:host)).find(params[:id])
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "scripts".* FROM "scripts" WHERE "scripts"."id" = $1  [["id", 2]]

      def slot_available_for?(effective_gender)
        script = @event.script_version.script
        confirmed = @event.event_members.confirmed.includes(:user)

        male_filled = @event.offline_male
        female_filled = @event.offline_female
        any_filled = 0

        confirmed.each do |m|
---
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 1], ["id", 2]]
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2, $3)  [["id", 1], ["id", 2], ["id", 3]]

      def has_members?
        @event.event_members.where.not(user_id: @event.host_id).exists?
---
SELECT 1 AS one FROM "event_members" WHERE "event_members"."event_id" = $1 AND "event_members"."user_id" != $2 LIMIT $3  [["event_id", 8], ["user_id", 1], ["LIMIT", 1]]