app/controllers/api/v1/events_controller.rb

      def index
        events = Event.includes(:script, :host).all
        events = events.where(status: params[:status]) if params[:status].present?
        events = events.where(script_id: params[:script_id]) if params[:script_id].present?
        events = events.where("scheduled_at >= ?", Date.parse(params[:date])) if params[:date].present?
        render json: events.map { |e| EventSerializer.new(e).as_json }
---
SELECT "events".* FROM "events" WHERE "events"."deleted_at" IS NULL
SELECT "scripts".* FROM "scripts" WHERE "scripts"."id" IN ($1, $2)  [["id", 1], ["id", 2]]
SELECT "events".* FROM "events" WHERE "events"."deleted_at" IS NULL AND "events"."status" = $1  [["status", 0]]
SELECT "scripts".* FROM "scripts" WHERE "scripts"."id" = $1  [["id", 1]]

      def create
        event = current_user.hosted_events.build(event_params)
        if event.save
          if ActiveModel::Type::Boolean.new.cast(params[:host_in_game])
            event.event_members.create!(
              user: current_user,
              status: :confirmed,
              cross_gender: ActiveModel::Type::Boolean.new.cast(params[:host_cross_gender])
            )
---
INSERT INTO "events" ("script_id", "host_id", "scheduled_at", "location", "status", "created_at", "updated_at", "allow_cross_gender", "offline_male", "offline_female", "deleted_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
INSERT INTO "event_members" ("event_id", "user_id", "status", "created_at", "updated_at", "cross_gender") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["event_id", 1], ["user_id", 1], ["status", 1], ["created_at", "2026-05-06 04:40:31.177291"], ["updated_at", "2026-05-06 04:40:31.177291"], ["cross_gender", false]]

      def update
        permitted = has_members? ? location_only_params : event_params

        old_location = @event.location
        if @event.update(permitted)
          if has_members? && @event.location != old_location
            AuditLog.create!(
              auditable: @event,
              user: current_user,
              action: "location_changed",
              metadata: { from: old_location, to: @event.location }
            )
---
UPDATE "events" SET "location" = $1, "updated_at" = $2 WHERE "events"."id" = $3  [["location", "從前從前"], ["updated_at", "2026-05-06 05:38:54.091247"], ["id", 1]]
INSERT INTO "audit_logs" ("auditable_type", "auditable_id", "user_id", "action", "metadata", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

      def join
        if @event.host_id == current_user.id
          return render json: { error: "You are the host" }, status: :unprocessable_entity
        end

        if @event.cancelled?
          return render json: { error: "Event is cancelled" }, status: :unprocessable_entity
        end

        member = @event.event_members.find_or_initialize_by(user_id: current_user.id)
---
SELECT "event_members".* FROM "event_members" WHERE "event_members"."event_id" = $1 AND "event_members"."user_id" = $2 LIMIT $3  [["event_id", 3], ["user_id", 2], ["LIMIT", 1]]

      def leave
        member = @event.event_members.find_by(user_id: current_user.id)
---
SELECT "event_members".* FROM "event_members" WHERE "event_members"."event_id" = $1 AND "event_members"."user_id" = $2 LIMIT $3  [["event_id", 3], ["user_id", 3], ["LIMIT", 1]]

      def set_event
        @event = Event.includes(:script, :host).find(params[:id])
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "scripts".* FROM "scripts" WHERE "scripts"."id" = $1  [["id", 1]]

      def slot_available_for?(effective_gender)
        script = @event.script
        confirmed = @event.event_members.confirmed.includes(:user)
---
SELECT "event_members".* FROM "event_members" WHERE "event_members"."event_id" = $1  [["event_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 1], ["id", 2]]

      def has_members?
        @event.event_members.exists?
---
SELECT "event_members".* FROM "event_members" WHERE "event_members"."event_id" = $1  [["event_id", 3]]