app/controllers/api/v1/event_members_controller.rb

      def update
        member = @event.event_members.find(params[:id])
        new_status = params[:status]

        unless valid_transition?(member, new_status)
          return render json: { error: "Invalid status transition" }, status: :unprocessable_entity
        end

        timestamp_field = "#{new_status}_at"
        attrs = { status: new_status }
        attrs[timestamp_field] = Time.current if member.class.column_names.include?(timestamp_field)

        if member.update(attrs)
---
SELECT "events".* FROM "events" WHERE "events"."deleted_at" IS NULL AND "events"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "event_members".* FROM "event_members" WHERE "event_members"."event_id" = $1 AND "event_members"."id" = $2 LIMIT $3  [["event_id", 1], ["id", 2], ["LIMIT", 1]]
UPDATE "event_members" SET "status" = $1, "updated_at" = $2, "confirmed_at" = $3 WHERE "event_members"."id" = $4  [["status", 1], ["updated_at", "2026-05-06 06:02:15.683115"], ["confirmed_at", "2026-05-06 06:02:15.682902"], ["id", 6]]

      def set_event
        @event = Event.find(params[:event_id])
---
SELECT "events".* FROM "events" WHERE "events"."deleted_at" IS NULL AND "events"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]