app/controllers/api/v1/scripts_controller.rb

      def index
        scripts = Script.where(status: :approved)
        scripts = scripts.where(difficulty: params[:difficulty]) if params[:difficulty].present?
        scripts = scripts.where("genres @> ARRAY[?]::integer[]", params[:genre].to_i) if params[:genre].present?
        scripts = scripts.where("title LIKE ?", "%#{params[:q]}%") if params[:q].present?
        scripts = scripts.limit(20) if params[:q].present?
---
SELECT "scripts".* FROM "scripts" WHERE "scripts"."difficulty" = $1  [["difficulty", 0]]
SELECT "scripts".* FROM "scripts"

      def show
        script = Script.find(params[:id])
---
SELECT "scripts".* FROM "scripts" WHERE "scripts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

      def create
        script = Script.new(script_params)
        if script.save
---
INSERT INTO "scripts" ("title", "genres", "description", "difficulty", "male_slots", "female_slots", "any_slots", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

      def update
        script = Script.find(params[:id])
        if script.update(script_params)
---
UPDATE "scripts" SET "updated_at" = $1 WHERE "scripts"."id" = $2  [["updated_at", "2026-05-06 04:01:47.173738"], ["id", 1]]