app/controllers/api/v1/users_controller.rb

SELECT "events".* FROM "events" INNER JOIN "event_members" ON "events"."id" = "event_members"."event_id" WHERE "events"."deleted_at" IS NULL AND "event_members"."user_id" = $1  [["user_id", 1]]
SELECT "scripts".* FROM "scripts" WHERE "scripts"."id" IN ($1, $2)  [["id", 1], ["id", 2]]
---
      def events
        hosted = current_user.hosted_events.includes(script_version: :script)
        joined = current_user.joined_events.includes(script_version: :script)
        render json: {
          hosted: hosted.map { |e| event_json(e) },
          joined: joined.map { |e| event_json(e) }