app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def authenticate!
    token = request.headers["Authorization"]&.split(" ")&.last
    payload = JwtAuthenticatable.decode(token)
    @current_user = User.find_by(id: payload&.dig("user_id"))