app/models/user.rb

SELECT 1 AS one FROM "users" WHERE "users"."handle" = $1 LIMIT $2  [["handle", "user5cvrfn"], ["LIMIT", 1]]
---
  def assign_handle
    return if handle.present?

    loop do
      candidate = "user#{SecureRandom.alphanumeric(6).downcase}"
      unless User.exists?(handle: candidate)